/*
Вычисление факториала в compile-time с помощью if constexpr
*/
#include <iostream>
#include <windows.h>
/*=====================================================*/
/*=====================================================*/
template <unsigned N>
constexpr unsigned factorial()
{
    if constexpr (N <= 1)
        return 1;
    else
        return N * factorial<N - 1>();
}
/*=====================================================*/
/*=====================================================*/
int main()
{
    SetConsoleOutputCP(65001);
    SetConsoleCP(65001);
    /*=====================================================*/
    /*=====================================================*/
    constexpr unsigned v5 = factorial<5>();
    std::cout << "factorial<5>() = " << v5 << '\n';
    /*=====================================================*/
    /*=====================================================*/
    return 0;
}
