#include <iostream>
#include <string>
#include <sstream>
#include <windows.h>


int main() {
    SetConsoleOutputCP(65001);
    SetConsoleCP(65001);
    /*=====================================================*/
    // 1. Чтение строки с пробелами
    /*=====================================================*/
    std::cout << "Введите фразу: ";
    std::string line;
    std::getline(std::cin, line); // считывает всю строку целиком
    std::cout << "Вы ввели: " << line << "\n";
    /*=====================================================*/
    /*=====================================================*/
    return 0;
}
