/*
Проверка свойств типов во время компиляции
*/
#include <limits>
#include <type_traits>
#include <iostream>
#include <windows.h>

/*=====================================================*/
/*=====================================================*/
// Проверяем, что int — знаковый
static_assert(std::numeric_limits<int>::is_signed, "int должен быть знаковым");
// Проверяем, что размер long long >= 8 байт
static_assert(sizeof(long long) >= 8, "long long должна быть не менее 64 бит");

/*=====================================================*/
/*=====================================================*/
int main() {
    SetConsoleOutputCP(65001);
    SetConsoleCP(65001);
    /*=====================================================*/
    /*=====================================================*/
    std::cout << "Проверка во время компиляции пройдена!" << '\n';
    /*=====================================================*/
    /*=====================================================*/
    return 0;
}
