/*
Чистая функция вычисления корня с обработкой ошибок
*/
#include <iostream>
#include <stdexcept>
#include <cmath>
#include <windows.h>

/*=====================================================*/
/*=====================================================*/
constexpr double safe_sqrt(double x) {
    if (x < 0.0) throw std::domain_error("Ошибка из 'safe_sqrt': корень из отрицательного числа!");
    return std::sqrt(x);
}

/*=====================================================*/
/*=====================================================*/
int main() {
    SetConsoleOutputCP(65001);
    SetConsoleCP(65001);
    bool flag = true; // true - выводить ошибку, false - нет
    /*=====================================================*/
    /*=====================================================*/
    // пример отрицательного
    if (flag) {
        try {
            double v{-4.0};
            std::cout << "sqrt(" << v << ") = " << safe_sqrt(v) << '\n';
        } catch (const std::exception &e) {
            std::cerr << " Error: " << e.what() << '\n';
            return 1;
        }
    }
    // пример положительного
    else { std::cout << "sqrt(16) = " << safe_sqrt(16.0) << '\n'; }
    /*=====================================================*/
    /*=====================================================*/
    return 0;
}
